# CanEnableCloudWorksharing Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..CanEnableCloudWorksharing Method
Document Class See Also
---
Checks if cloud worksharing can be enabled for the cloud model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.2
# Syntax
C#
---
```text
public bool CanEnableCloudWorksharing()
```

Visual Basic
---
```text
Public Function CanEnableCloudWorksharing As Boolean
```

Visual C++
---
```text
public:
bool CanEnableCloudWorksharing()
```

# ### Return Value
True if cloud worksharing can be enabled in the document, which also means the current document is a single user cloud model, False otherwise.
# See Also
Document Class
Autodesk.Revit.DB Namespace